src/bsl/InformationRegisters/гкс_СоответствияОбъектовСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СоответствияОбъектовСРПВ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ИнтеграцияСРПВСправочники</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаСРПВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыОбъектовСРПВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСРПВ</Name>
					<Comment>Идентификатор объекта СРПВ</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ИдентификаторыСРПВ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ЛогСобытийВебСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ЛогСобытийВебСервисов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСодержимого</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеЗаголовковЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеЗаголовковОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_РесурсыВебСервисов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Documents/гкс_СРПВПеревеска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_СРПВПеревеска</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтправки</Name>
					<Comment>WagonDispatchID</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлючиАналитикиСРПВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СРПВТипыОперацийСВагоном</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груженый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ОборудованиеПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТары</Name>
					<Comment>Дата взвешивания тары</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБрутто</Name>
					<Comment>Дата взвешивания брутто</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузИдентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/Documents/гкс_СРПВРегистрацияОперацииСВагоном.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_СРПВРегистрацияОперацииСВагоном</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтправки</Name>
					<Comment>WagonDispatchID</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлючиАналитикиСРПВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СРПВТипыОперацийСВагоном</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/Catalogs/гкс_КлючиАналитикиСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_КлючиАналитикиСРПВ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВагона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_НомерВагона</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтправкиВагона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_WagonDispatchID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЛК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/CommonModules/гкс_ИнтеграцияСРПВ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.РегламентныеЗадания

// Определяет зависимости регламентных заданий и их дополнительные свойства.
//
// Параметры:
//  Настройки - ТаблицаЗначений:
//    * РегламентноеЗадание - ОбъектМетаданныхРегламентноеЗадание - регламентное задание.
//    * ФункциональнаяОпция - ОбъектМетаданныхФункциональнаяОпция - функциональная опция,
//        от которой зависит регламентное задание.
//    * ЗависимостьПоИ - Булево - если регламентное задание зависит более чем
//        от одной функциональной опции и его необходимо включать только тогда,
//        когда все функциональные опции включены, то следует указывать Истина
//        для каждой зависимости.
//        По умолчанию Ложь - если хотя бы одна функциональная опция включена,
//        то регламентное задание тоже включено.
//    * ВключатьПриВключенииФункциональнойОпции - Булево
//                                              - Неопределено - если Ложь, то при
//        включении функциональной опции регламентное задание не будет включаться. Значение
//        Неопределено соответствует значению Истина.
//        По умолчанию - Неопределено.
//    * ДоступноВПодчиненномУзлеРИБ - Булево
//                                  - Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в РИБ.
//        По умолчанию - Неопределено.
//    * ДоступноВАвтономномРабочемМесте - Булево
//                                      - Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в автономном рабочем месте.
//        По умолчанию - Неопределено.
//    * ДоступноВМоделиСервиса - Булево
//                             - Неопределено - Ложь, если необходимо блокировать выполнение регламентного
//        задания (в т.ч. задания очереди) в информационной базе с включенным использованием разделителя.
//        Значение Неопределено трактуется как Истина.
//        По умолчанию - Неопределено.
//    * РаботаетСВнешнимиРесурсами - Булево - Истина, если регламентное задание модифицирует данные
//        во внешних источниках (получение почты, синхронизация данных и т.п.). Не следует устанавливать
//        значение Истина для регламентных заданий, не модифицирующих данные во внешних источниках.
//        Например, регламентное задание ЗагрузкаКурсовВалют. Регламентные задания, работающие с внешними ресурсами,
//        автоматически отключаются в копии информационной базы. По умолчанию - Ложь.
//    * Параметризуется - Булево - Истина, если регламентное задание параметризованное.
//        По умолчанию - Ложь.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт

	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_СРПВСозданиеДоументов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.гкс_ИспользоватьИнтеграциюСРПВ;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	Настройка.ДоступноВМоделиСервиса = Ложь;
	Настройка.ВключатьПриВключенииФункциональнойОпции = Истина;

	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_ОповещениеОПроблемахДоставкиСообщенийСРПВ;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.гкс_ИспользоватьИнтеграциюСРПВ;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	Настройка.ДоступноВМоделиСервиса = Ложь;
	Настройка.ВключатьПриВключенииФункциональнойОпции = Истина;

КонецПроцедуры

// Конец СтандартныеПодсистемы.РегламентныеЗадания

#КонецОбласти

// Входная точка для формирования сообщения для Кверион
//
// Параметры:
//  СообщениеОбъект - ОбъектXDTO - загруженное сообщение из СРПВ
//	КомпонентыОбмена - Структура - струкутра для проведения обмена
//
Процедура ОбработатьВходящееСообщение(СообщениеОбъект, КомпонентыОбмена) Экспорт

	ТипКонтракта = СообщениеОбъект.Тип().Имя;

	Если ТипКонтракта = "srpv.WaggonReceive" Тогда
		МенеджерОбъекта = Документы.гкс_СРПВПрибытиеНаПуть;
		ТипЗагружаемогоОбъекта = "Документ";
		ТипОперации = Перечисления.гкс_ТипРегистрации.Приемка;

	ИначеЕсли ТипКонтракта = "srpv.WaggonWeighting" Тогда
		МенеджерОбъекта = Документы.гкс_СРПВПеревеска;
		ТипЗагружаемогоОбъекта = "Документ";
		ТипОперации = ТипОперацииПоДаннымСообщения(СообщениеОбъект);

	ИначеЕсли ТипКонтракта = "srpv.CargoOperations" Тогда
		МенеджерОбъекта = Документы.гкс_СРПВРегистрацияОперацииСВагоном;
		ТипЗагружаемогоОбъекта = "Документ";
		ТипОперации = ТипОперацииПоДаннымСообщения(СообщениеОбъект);

	ИначеЕсли ТипКонтракта = "srpv.PermissionProcessedNotification" Тогда
		ДанныеОбъекта = ОбъектXDTOВСтруктуру(СообщениеОбъект);
		ДанныеОбъекта.Вставить("ИдентификаторСообщения", КомпонентыОбмена.НомерСообщения);
		МенеджерОбъекта = ОбщегоНазначения.ОбщийМодуль("гкс_ПодтверждениеДоставкиСообщений");
		РезультатОбработки = МенеджерОбъекта.ОбработатьВходящееСообщение(ДанныеОбъекта);
		Если Не РезультатОбработки.Источник = Неопределено Тогда
			КомпонентыОбмена.ЗагруженныеОбъектыСеансаОбмена.Добавить(РезультатОбработки.Источник);
		КонецЕсли;

		Возврат;
	Иначе
		Возврат;
	КонецЕсли;

	// загружаем сообщения только для текущего ПЛК
	Если Не РегистрыСведений.гкс_СоответствияОбъектовСРПВ.ЭтоИдентификаторТекущегоПЛК(СообщениеОбъект.ID_PLK) Тогда
		Возврат;
	КонецЕсли;

	ДанныеОбъекта = ОбъектXDTOВСтруктуру(СообщениеОбъект);

	Если ТипЗагружаемогоОбъекта = "Документ" Тогда
		// инициализируем идентификатор отправки
		КлючиАналитикиСРПВМенеджер = Справочники.гкс_КлючиАналитикиСРПВ;

		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторОтправкиВагона", ДанныеОбъекта.WagonDispatchId);
		Отбор.Вставить("НомерВагона", ДанныеОбъекта.WagonNumber);
		Отбор.Вставить("ТипОперации", ТипОперации);
		ЭтоНовый = Ложь;
		КлючАналитики = КлючиАналитикиСРПВМенеджер.ЗначениеКлючаАналитики(Отбор, ЭтоНовый);

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(
			гкс_ОбщегоНазначения.ИмяТаблицыПоСсылке(КлючАналитики));
		ЭлементБлокировки.УстановитьЗначение("Ссылка", КлючАналитики);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();

		Если ЭтоНовый Тогда
			КомпонентыОбмена.ЗагруженныеОбъектыСеансаОбмена.Добавить(КлючАналитики);
		КонецЕсли;

		ДанныеОбъекта.Вставить("ИдентификаторОтправки", КлючАналитики);
		НайденаяЗапись = МенеджерОбъекта.ПолучитьСсылкуПоИдентификаторуОтправки(КлючАналитики);

		Если ЗначениеЗаполнено(НайденаяЗапись) Тогда
			ОбъектПриемник = НайденаяЗапись.ПолучитьОбъект();
			Попытка
				ОбъектПриемник.Заблокировать();
			Исключение

				ИнфОшибки = ИнформацияОбОшибке();
				ПодробноеОписание = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфОшибки);

				ЧастиСообщения = Новый Массив;
				ЧастиСообщения.Добавить(НСтр("ru = 'Не удалось заблокировать документ для редактирования'"));
				ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Документ: %1'"), НайденаяЗапись));
				ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Причина: %1'"), ПодробноеОписание));

				ВызватьИсключение СтрСоединить(ЧастиСообщения, Символы.ПС);

			КонецПопытки;
		Иначе
			ОбъектПриемник = МенеджерОбъекта.СоздатьДокумент();
		КонецЕсли;

	Иначе
		ВызватьИсключение НСтр("ru = 'Обработку справочников необходимо доработать'");
	КонецЕсли;

	ПравилаКонвертации = МенеджерОбъекта.ИнициализацияПравилКонвертацийСвойств();
	ОбработатьОбъектКонвертации(ПравилаКонвертации, ДанныеОбъекта, ОбъектПриемник);
	КомпонентыОбмена.ЗагруженныеОбъектыСеансаОбмена.Добавить(ОбъектПриемник.Ссылка);

КонецПроцедуры

// Метод формирует сообщение для помещения в очередь обмена.
// Для валидации входящих данных формируется ОбъектXDTO и только после этого формируется строка сообщения.
// Если валидация не выполнена, будет сгенерировано исключение.
//
// Параметры:
//  ДанныеСообщения - Структура - соответствующая типу объекта srpv.PermittedRoutes
//  								(http://sodrugestvo.com/srpv-messages/1.00)
//
// Возвращаемое значение:
//  Строка - Сформированное исходящее сообщение.
Функция СформироватьИсходящееСообщение(ДанныеСообщения) Экспорт

	ОбъектXDTO = СтруктуруВОбъектXDTO(ДанныеСообщения, "srpv.PermittedRoutes");
	ОбъектXDTO.Проверить();	// Валидация объекта
	СтруктураПоОбъекту = ОбъектXDTOВСтруктуру(ОбъектXDTO);
	Возврат КоннекторHTTP.ОбъектВJson(СтруктураПоОбъекту);

КонецФункции

// Получить информацию о нахождении вагонов.
Процедура ПолучитьИнформациюОНахожденииВагонов() Экспорт

	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСРПВ") Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.гкс_ОбновлениеИнформацииОВагонахСРПВ);

	ДанныеОПоложенииНаПутях = ТекущееПоложениеВагоновНаПутях();
	Если Не ДанныеОПоложенииНаПутях.Свойство("WaggonParkDislocation") Тогда
		Возврат;
	КонецЕсли;

	МодульОбработки = ОбщегоНазначения.ОбщийМодуль("РегистрыСведений.гкс_НахождениеВагоновНаПутяхСРПВ");
	МодульОбработки.АктуализироватьИнформациюОПоложенииВагоновНаПутях(ДанныеОПоложенииНаПутях.WaggonParkDislocation);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипКонтрактаXDTO(ТипКонтракта) Экспорт

	ПространствоИмен = ОсновноеПространствоИмен();

	Возврат ФабрикаXDTO.Тип(ПространствоИмен, ТипКонтракта);

КонецФункции

Функция ОсновноеПространствоИмен() Экспорт

	Возврат "http://sodrugestvo.com/srpv-messages/1.00";

КонецФункции

// Инициализирует таблицу правил конвертации объекта.
//
// Возвращаемое значение:
//  ТаблицаЗначений - пустая таблица значений с колонками.
//		- СвойствоКонфигурации 				- имя реквизита кофигурации для заполнения
//		- СвойствоИсточника 				- имя свойства источника для получения значения данных заполнения
//		- ИспользуетсяАлгоритмКонвертации 	- признак использования обработчика заполнения
//		- ПравилоКонвертацииСвойства 		- имя процедуры обработчика заполнения свойства
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт

	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("СвойствоКонфигурации");
	ПравилаКонвертации.Колонки.Добавить("СвойствоИсточника");
	ПравилаКонвертации.Колонки.Добавить("ИспользуетсяАлгоритмКонвертации");
	ПравилаКонвертации.Колонки.Добавить("ПравилоКонвертацииСвойства");

	Возврат ПравилаКонвертации;

КонецФункции

// Заполняет строку правил конвертации значениями.
//
// Параметры:
//  ПравилаКонвертации - СтрокаТаблицыЗначений - строка таблицы правил конвертации.
//  СвойствоКонфигурации - Строка - имя реквизита кофигурации для заполнения.
//	СвойствоИсточника - Строка - имя свойства источника для получения значения данных заполнения
//	ИспользуетсяАлгоритмКонвертации - Число	- 1 если используется обработчик заполнения, 0 - обработчик не используется
//	ПравилоКонвертацииСвойства - Строка	- имя процедуры обработчика заполнения свойства
//
Процедура ДобавитьПКС(ПравилаКонвертации, СвойствоКонфигурации, СвойствоИсточника, ИспользуетсяАлгоритмКонвертации = 0,
		ПравилоКонвертацииСвойства = "") Экспорт

	НоваяСтрока                                 = ПравилаКонвертации.Добавить();
	НоваяСтрока.СвойствоКонфигурации            = СвойствоКонфигурации;
	НоваяСтрока.СвойствоИсточника               = СвойствоИсточника;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства      = ПравилоКонвертацииСвойства;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаВходящихСообщений

Процедура ОбработатьОбъектКонвертации(ПравилаКонвертации, ПолученныеДанные, ОбъектКонфигурации)

	МетаданныеОбъекта = ОбъектКонфигурации.Метаданные();

	Если гкс_ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
		МенеджерОбъекта = Документы[МетаданныеОбъекта.Имя];
	ИначеЕсли гкс_ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта) Тогда
		МенеджерОбъекта = Справочники[МетаданныеОбъекта.Имя];
	Иначе
		ВызватьИсключение НСтр("ru = 'Некорректный тип загрузки'");
	КонецЕсли;

	ДанныеЗаполнения = Новый Структура;
	Для Каждого ПравилоКонвертации Из ПравилаКонвертации Цикл

		Если ПравилоКонвертации.ИспользуетсяАлгоритмКонвертации Тогда
			МенеджерОбъекта.ВыполнитьПроцедуруОбработчикаЗаполнения(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения);
		Иначе
			НайденноеЗначение = Неопределено;
			Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, НайденноеЗначение) Тогда
				ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, НайденноеЗначение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ЗаполнитьЗначенияСвойств(ОбъектКонфигурации, ДанныеЗаполнения);
	ПровестиГенерациюКодаНомераПриНеобходимости(ОбъектКонфигурации);

	Если ПолученныеДанные.Свойство("Method")
		И ПолученныеДанные.Method = "Delete" Тогда
		ОбъектКонфигурации.ПометкаУдаления = Истина;
	Иначе
		ОбъектКонфигурации.ПометкаУдаления = Ложь;
	КонецЕсли;

	Попытка

		Если гкс_ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
			РежимЗаписи = ?(ОбъектКонфигурации.ПометкаУдаления,
				РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Проведение);

			ОбъектКонфигурации.Записать(РежимЗаписи);
		Иначе
			ОбъектКонфигурации.Записать();
		КонецЕсли;

	Исключение

		ИнфОшибки = ИнформацияОбОшибке();
		СообщениеОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфОшибки);
		КраткоеОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнфОшибки);

		ЧастиСообщения = Новый Массив;
		ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Не удалось записать %1'"), ОбъектКонфигурации));
		ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Причина: %1'"), КраткоеОписаниеОшибки));
		Если ОбъектКонфигурации.ДополнительныеСвойства.Свойство("СообщенияОбОшибках") Тогда
			ПояснениеОшибки = СтрСоединить(
				ОбъектКонфигурации.ДополнительныеСвойства.СообщенияОбОшибках, Символы.ПС);
			СообщениеОбОшибке = СтрШаблон("%1
				|
				|%2", СообщениеОбОшибке, ПояснениеОшибки);
			ЧастиСообщения.Добавить(ПояснениеОшибки);
		КонецЕсли;

		ТекстОшибки = СтрСоединить(ЧастиСообщения, Символы.ПС);

		// Записываем в журнал регистрации полную информацию об ошибке
		ЗаписьЖурналаРегистрации(
			"Интеграция СРПВ. Обработка сообщений",
			УровеньЖурналаРегистрации.Ошибка,
			МетаданныеОбъекта,
			ОбъектКонфигурации.Ссылка,
			СообщениеОбОшибке);

		ВызватьИсключение ТекстОшибки;

	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ПодготовкаСообщенийКОтправке

Функция СтруктуруВОбъектXDTO(ДанныеВСтруктуре, ТипXDTOОбъекта)

	ПространствоИмен 	= ОсновноеПространствоИмен();
	ОбъектXDTO 			= НовыйОбъектXDTO(ТипXDTOОбъекта, ПространствоИмен);

	ЗаполнитьОбъектXDTO(ОбъектXDTO, ДанныеВСтруктуре);

	Возврат ОбъектXDTO;

КонецФункции

Функция НовыйОбъектXDTO(ТипОбъектаСтрокой, Знач ПространствоИмен = Неопределено)

	Если ПространствоИмен = Неопределено Тогда
		ПространствоИмен = ОсновноеПространствоИмен();
	КонецЕсли;

	Возврат гкс_ОбщегоНазначения.СоздатьОбъект(ТипОбъектаСтрокой, ПространствоИмен);

КонецФункции

Процедура ЗаполнитьОбъектXDTO(ОбъектXDTO, Знач ЗначенияСвойств, Знач Замещать = Истина)

	Перем ЗначениеXDTO;

	Для Каждого СвойствоXDTO Из ОбъектXDTO.Свойства() Цикл

		Если Не ЗначенияСвойств.Свойство(СвойствоXDTO.Имя, ЗначениеXDTO) Тогда
			Продолжить;
		КонецЕсли;

		УстановитьЗначениеСвойстваXDTO(ОбъектXDTO, СвойствоXDTO.Имя, ЗначениеXDTO, Замещать);

	КонецЦикла;

КонецПроцедуры

Процедура УстановитьЗначениеСвойстваXDTO(ОбъектXDTO, Знач ИмяСвойства, Знач Значение, Знач Замещать = Истина)

	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗначениеСвойства 	= ОбъектXDTO[ИмяСвойства];
	ТипЗначенияСвойства = ТипЗнч(ЗначениеСвойства);
	ТипОбъектаXDTO 		= ОбъектXDTO.Тип();
	СвойствоXDTO 		= ТипОбъектаXDTO.Свойства.Получить(ИмяСвойства);
	Если СвойствоXDTO = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не Замещать И ОбъектXDTO.Получить(СвойствоXDTO) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗначенияСвойства = Тип("ОбъектXDTO") Тогда

		Для Каждого мСвойствоXDTO Из ЗначениеСвойства.Свойства() Цикл
			УстановитьЗначениеСвойстваXDTO(ЗначениеСвойства, мСвойствоXDTO.Имя, Значение, Замещать);
		КонецЦикла;

		ОбъектXDTO.Установить(СвойствоXDTO, ЗначениеСвойства);

	ИначеЕсли ТипЗначенияСвойства = Тип("СписокXDTO") Тогда

		Для Каждого Элемент Из Значение Цикл

			НовыйОбъект = НовыйОбъектXDTO(СвойствоXDTO.Тип.Имя);
			Если ТипЗнч(Элемент) = Тип("Структура") Тогда

				Для Каждого КлючИЗначение Из Элемент Цикл
					УстановитьЗначениеСвойстваXDTO(НовыйОбъект, КлючИЗначение.Ключ, КлючИЗначение.Значение, Замещать);
				КонецЦикла;

			Иначе
				УстановитьЗначениеСвойстваXDTO(НовыйОбъект, СвойствоXDTO.Имя, Элемент, Замещать);
			КонецЕсли;

			ЗначениеСвойства.Добавить(НовыйОбъект);

		КонецЦикла;

	Иначе

		Если СвойствоXDTO.Тип.Фасеты <> Неопределено И СвойствоXDTO.Тип.Фасеты.Количество() = 0 Тогда
			ОбъектXDTO.Установить(СвойствоXDTO, Значение);
		Иначе
			ОбъектXDTO.Установить(СвойствоXDTO, ФабрикаXDTO.Создать(СвойствоXDTO.Тип, Значение));
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Функция ТипОперацииПоДаннымСообщения(ДанныеОбъекта)

	МэппингТиповРегистрации = Новый Соответствие();
	МэппингТиповРегистрации.Вставить(0, Перечисления.гкс_ТипРегистрации.Отгрузка);
	МэппингТиповРегистрации.Вставить(1, Перечисления.гкс_ТипРегистрации.Приемка);

	Возврат МэппингТиповРегистрации.Получить(ДанныеОбъекта.OperType);

КонецФункции

// Преобразует объект XDTO в структуру
//
// Параметры:
//  ОбъектXDTO - ОбъектXDTO - Объект XDTO
//
// Возвращаемое значение:
//  Структура - Структура объекта.
//
Функция ОбъектXDTOВСтруктуру(ОбъектXDTO) Экспорт

	Структура = Новый Структура;

	Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл

		ИмяСвойства      = Свойство.Имя;
		ЗначениеСвойства = ОбъектXDTO[ИмяСвойства];
		ТипЗначенияСвойства = ТипЗнч(ЗначениеСвойства);

		Если ТипЗначенияСвойства = Тип("ОбъектXDTO") Тогда

			Если ЗначениеСвойства.Свойства().Получить("value") <> Неопределено Тогда
				ЗначениеСвойства_value = ЗначениеСвойства.Получить("value");
				Структура.Вставить(ИмяСвойства, ЗначениеСвойства_value);
			Иначе
				Структура.Вставить(ИмяСвойства, ОбъектXDTOВСтруктуру(ЗначениеСвойства));
			КонецЕсли;

		ИначеЕсли ТипЗначенияСвойства = Тип("СписокXDTO") Тогда

			Структура.Вставить(ИмяСвойства, Новый Массив);
			Для Индекс = 0 По ЗначениеСвойства.Количество() - 1 Цикл

				ЭлементСписка = ЗначениеСвойства.Получить(Индекс);
				Если ТипЗнч(ЭлементСписка) = Тип("ОбъектXDTO") Тогда
					Структура[ИмяСвойства].Добавить(ОбъектXDTOВСтруктуру(ЭлементСписка));
				Иначе
					Структура[ИмяСвойства].Добавить(ЭлементСписка);
				КонецЕсли;

			КонецЦикла;

		Иначе

			Структура.Вставить(ИмяСвойства, ЗначениеСвойства);
		КонецЕсли;

	КонецЦикла;

	Возврат Структура;

КонецФункции

Процедура ПровестиГенерациюКодаНомераПриНеобходимости(Объект)

	ОбъектыСНомером = "Документ, БизнесПроцесс, Задача";
	ОбъектыСКодом = "Справочник, ПланВидовХарактеристик";

	ИмяТипаОбъекта = гкс_ОбщегоНазначения.ВидОбъектаПоТипу(ТипЗнч(Объект.Ссылка));

	// По типу документа смотрим заполнен код или номер.
	Если СтрНайти(ОбъектыСНомером, ИмяТипаОбъекта) > 0
		И Не ЗначениеЗаполнено(Объект.Номер) Тогда

		Объект.УстановитьНовыйНомер();

	ИначеЕсли СтрНайти(ОбъектыСКодом, ИмяТипаОбъекта) > 0
		И Не ЗначениеЗаполнено(Объект.Код)
		И Объект.Метаданные().Автонумерация Тогда

		Объект.УстановитьНовыйКод();
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

Функция ТекущееПоложениеВагоновНаПутях()

	WSПрокси = гкс_ИнтеграцияСРПВПовтИсп.ПроксиВебСервисаСРПВ();

	ИдентификаторПЛК = гкс_ИнтеграцияСРПВПовтИсп.ИдентификаторТекущегоПЛК();
	Если Не ЗначениеЗаполнено(ИдентификаторПЛК) Тогда
		ТекущийПЛК = гкс_ИнтеграцияСРПВПовтИсп.ТекущийПЛК();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не определен идентификатор текущей ПЛК!
				|Проверьте наличие записи для %1 в регистре Соответствие объектов СРПВ.'"), ТекущийПЛК);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	ОтветСервиса 	= WSПрокси.GetWaggonsParkDislocation(ИдентификаторПЛК);
	ПолученныйТип 	= ТипЗнч(ОтветСервиса);
	Если ПолученныйТип = Тип("ОбъектXDTO") Тогда

		СтруктураОтвета = ОбъектXDTOВСтруктуру(ОтветСервиса);
		Событиелога 	= СобытиеЛогаСРПВ("GetWaggonsParkDislocation");
		СобытиеЛога.ХранилищеОтвета = Новый ХранилищеЗначения(СтруктураОтвета);
		РегистрыСведений.гкс_ЛогСобытийВебСервисов.Логировать(СобытиеЛога);

	Иначе

		СтруктураОтвета = Новый Структура;
		ТекстОшибки 	= СтрШаблон(
			НСтр("ru = 'Получен непредвиденный ответ сервиса
				|Ожидается ОбъектXDTO, получен ответ с типом %1'"), ПолученныйТип);
		ЗаписьЖурналаРегистрации(
			"Интеграция СРПВ. GetWaggonsParkDislocation", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);

	КонецЕсли;

	Возврат СтруктураОтвета;

КонецФункции

Функция СобытиеЛогаСРПВ(ИмяМетода) Экспорт

	Событие = Новый Структура;
	Событие.Вставить("УниверсальнаяДата", 			ТекущаяУниверсальнаяДатаВМиллисекундах());
	Событие.Вставить("ИмяМетода", 					ИмяМетода);
	Событие.Вставить("Идентификатор", 				XMLСтрока(Новый УникальныйИдентификатор()));
	Событие.Вставить("КодСостояния", 				0);
	Событие.Вставить("Длительность", 				0);
	Событие.Вставить("ХранилищеЗапроса", 			Неопределено);
	Событие.Вставить("ХранилищеОтвета", 			Неопределено);
	Событие.Вставить("ХранилищеЗаголовковЗапроса", 	Неопределено);
	Событие.Вставить("ХранилищеЗаголовковОтвета", 	Неопределено);
	Событие.Вставить("Дата", 						ТекущаяДатаСеанса());
	Событие.Вставить("ТипСодержимого", 				"");

	Возврат Событие;
КонецФункции

#КонецОбласти
